# raw data to clean data conversion using python EDA

In [1]:
import pandas as pd

In [2]:
emp = pd.read_excel(r'C:\Users\marot\Documents\Rawdata.xlsx')

In [3]:
emp

     Name          Domain       Age   Location   Salary      Exp
0    Mike   Datascience#$  34 years     Mumbai   5^00#0       2+
1  Teddy^         Testing    45' yr  Bangalore  10%%000       <3
2   Uma#r  Dataanalyst^^#       NaN        NaN  1$5%000   4> yrs
3    Jane     Ana^^lytics       NaN   Hyderbad   2000^0      NaN
4  Uttam*      Statistics     67-yr        NaN   30000-  5+ year
5     Kim             NLP      55yr      Delhi  6000^$0      10+

In [4]:
emp.columns

Index(['Name', 'Domain', 'Age', 'Location', 'Salary', 'Exp'], dtype='object')

In [5]:
emp.shape

(6, 6)

In [6]:
emp.head()

     Name          Domain       Age   Location   Salary      Exp
0    Mike   Datascience#$  34 years     Mumbai   5^00#0       2+
1  Teddy^         Testing    45' yr  Bangalore  10%%000       <3
2   Uma#r  Dataanalyst^^#       NaN        NaN  1$5%000   4> yrs
3    Jane     Ana^^lytics       NaN   Hyderbad   2000^0      NaN
4  Uttam*      Statistics     67-yr        NaN   30000-  5+ year

In [7]:
emp.tail()

     Name          Domain     Age   Location   Salary      Exp
1  Teddy^         Testing  45' yr  Bangalore  10%%000       <3
2   Uma#r  Dataanalyst^^#     NaN        NaN  1$5%000   4> yrs
3    Jane     Ana^^lytics     NaN   Hyderbad   2000^0      NaN
4  Uttam*      Statistics   67-yr        NaN   30000-  5+ year
5     Kim             NLP    55yr      Delhi  6000^$0      10+

In [8]:
emp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      6 non-null      object
 1   Domain    6 non-null      object
 2   Age       4 non-null      object
 3   Location  4 non-null      object
 4   Salary    6 non-null      object
 5   Exp       5 non-null      object
dtypes: object(6)
memory usage: 420.0+ bytes

In [9]:
emp

     Name          Domain       Age   Location   Salary      Exp
0    Mike   Datascience#$  34 years     Mumbai   5^00#0       2+
1  Teddy^         Testing    45' yr  Bangalore  10%%000       <3
2   Uma#r  Dataanalyst^^#       NaN        NaN  1$5%000   4> yrs
3    Jane     Ana^^lytics       NaN   Hyderbad   2000^0      NaN
4  Uttam*      Statistics     67-yr        NaN   30000-  5+ year
5     Kim             NLP      55yr      Delhi  6000^$0      10+

In [10]:
emp['Domain']

0     Datascience#$
1           Testing
2    Dataanalyst^^#
3       Ana^^lytics
4        Statistics
5               NLP
Name: Domain, dtype: object

In [11]:
emp.isnull()

    Name  Domain    Age  Location  Salary    Exp
0  False   False  False     False   False  False
1  False   False  False     False   False  False
2  False   False   True      True   False  False
3  False   False   True     False   False   True
4  False   False  False      True   False  False
5  False   False  False     False   False  False

In [12]:
emp.isnull().sum()

Name        0
Domain      0
Age         2
Location    2
Salary      0
Exp         1
dtype: int64

In [13]:
emp['Name']

0      Mike
1    Teddy^
2     Uma#r
3      Jane
4    Uttam*
5       Kim
Name: Name, dtype: object

In [14]:
emp['Name'] = emp['Name'].str.replace(r'\W','')

In [15]:
emp['Name']

0      Mike
1    Teddy^
2     Uma#r
3      Jane
4    Uttam*
5       Kim
Name: Name, dtype: object

In [16]:
emp['Domain']

0     Datascience#$
1           Testing
2    Dataanalyst^^#
3       Ana^^lytics
4        Statistics
5               NLP
Name: Domain, dtype: object

In [17]:
emp['Domain'] = emp['Domain'].str.replace(r'\W','')

In [18]:
emp['Domain']

0     Datascience#$
1           Testing
2    Dataanalyst^^#
3       Ana^^lytics
4        Statistics
5               NLP
Name: Domain, dtype: object

In [19]:
emp

     Name          Domain       Age   Location   Salary      Exp
0    Mike   Datascience#$  34 years     Mumbai   5^00#0       2+
1  Teddy^         Testing    45' yr  Bangalore  10%%000       <3
2   Uma#r  Dataanalyst^^#       NaN        NaN  1$5%000   4> yrs
3    Jane     Ana^^lytics       NaN   Hyderbad   2000^0      NaN
4  Uttam*      Statistics     67-yr        NaN   30000-  5+ year
5     Kim             NLP      55yr      Delhi  6000^$0      10+

In [20]:
emp['Age'] = emp['Age'].str.replace(r'\W','')

In [21]:
emp['Age']

0    34 years
1      45' yr
2         NaN
3         NaN
4       67-yr
5        55yr
Name: Age, dtype: object

In [22]:
emp['Age'] = emp['Age'].str.extract('(\d+)')

<>:1: SyntaxWarning: invalid escape sequence '\d'
<>:1: SyntaxWarning: invalid escape sequence '\d'
C:\Users\marot\AppData\Local\Temp\ipykernel_12644\1884116463.py:1: SyntaxWarning: invalid escape sequence '\d'
  emp['Age'] = emp['Age'].str.extract('(\d+)')

In [23]:
emp['Age']

0     34
1     45
2    NaN
3    NaN
4     67
5     55
Name: Age, dtype: object

In [24]:
emp

     Name          Domain  Age   Location   Salary      Exp
0    Mike   Datascience#$   34     Mumbai   5^00#0       2+
1  Teddy^         Testing   45  Bangalore  10%%000       <3
2   Uma#r  Dataanalyst^^#  NaN        NaN  1$5%000   4> yrs
3    Jane     Ana^^lytics  NaN   Hyderbad   2000^0      NaN
4  Uttam*      Statistics   67        NaN   30000-  5+ year
5     Kim             NLP   55      Delhi  6000^$0      10+

In [25]:
emp['Location'] = emp['Location'].str.replace(r'\W','')

In [26]:
emp['Location']

0       Mumbai
1    Bangalore
2          NaN
3     Hyderbad
4          NaN
5        Delhi
Name: Location, dtype: object

In [27]:
emp['Salary']

0     5^00#0
1    10%%000
2    1$5%000
3     2000^0
4     30000-
5    6000^$0
Name: Salary, dtype: object

In [63]:
emp['Salary'] = emp['Salary'].str.replace(r'\W','')

In [64]:
emp['Salary']

0     5^00#0
1    10%%000
2    1$5%000
3     2000^0
4     30000-
5    6000^$0
Name: Salary, dtype: object

In [30]:
emp

     Name          Domain  Age   Location   Salary      Exp
0    Mike   Datascience#$   34     Mumbai   5^00#0       2+
1  Teddy^         Testing   45  Bangalore  10%%000       <3
2   Uma#r  Dataanalyst^^#  NaN        NaN  1$5%000   4> yrs
3    Jane     Ana^^lytics  NaN   Hyderbad   2000^0      NaN
4  Uttam*      Statistics   67        NaN   30000-  5+ year
5     Kim             NLP   55      Delhi  6000^$0      10+

In [62]:
emp['Exp']

0      2
1      3
2      4
3    NaN
4      5
5     10
Name: Exp, dtype: object

<>:1: SyntaxWarning: invalid escape sequence '\d'
<>:1: SyntaxWarning: invalid escape sequence '\d'
C:\Users\marot\AppData\Local\Temp\ipykernel_12644\3836251810.py:1: SyntaxWarning: invalid escape sequence '\d'
  emp['Exp'] = emp['Exp'].str.extract('(\d+)')

In [61]:
emp['Exp']

0      2
1      3
2      4
3    NaN
4      5
5     10
Name: Exp, dtype: object

In [34]:
emp

     Name          Domain  Age   Location   Salary  Exp
0    Mike   Datascience#$   34     Mumbai   5^00#0    2
1  Teddy^         Testing   45  Bangalore  10%%000    3
2   Uma#r  Dataanalyst^^#  NaN        NaN  1$5%000    4
3    Jane     Ana^^lytics  NaN   Hyderbad   2000^0  NaN
4  Uttam*      Statistics   67        NaN   30000-    5
5     Kim             NLP   55      Delhi  6000^$0   10

In [59]:
clean_data = emp.copy()

#### till now we have raw data we use regex to clean the data and removed all noise characted from the dataset 
#### you can also work in same things in sql query as well

- missing values treatment for numerical data

In [36]:
clean_data

     Name          Domain  Age   Location   Salary  Exp
0    Mike   Datascience#$   34     Mumbai   5^00#0    2
1  Teddy^         Testing   45  Bangalore  10%%000    3
2   Uma#r  Dataanalyst^^#  NaN        NaN  1$5%000    4
3    Jane     Ana^^lytics  NaN   Hyderbad   2000^0  NaN
4  Uttam*      Statistics   67        NaN   30000-    5
5     Kim             NLP   55      Delhi  6000^$0   10

In [58]:
clean_data['Age']

0    34
1    45
2    50
3    50
4    67
5    55
Name: Age, dtype: int32

In [38]:
import numpy as np

In [56]:
clean_data['Age'] = clean_data['Age'].fillna(np.mean(pd.to_numeric(clean_data['Age'])))

In [57]:
clean_data['Age']

0    34
1    45
2    50
3    50
4    67
5    55
Name: Age, dtype: int32

In [6]:
clean_data['Exp']

NameError: name 'clean_data' is not defined

In [5]:
clean_data['Exp'] = clean_data['Exp'].fillna(np.mean(pd.to_numeric(clean_data['Exp'])))

NameError: name 'clean_data' is not defined

In [55]:
clean_data['Exp']

0      2
1      3
2      4
3    4.8
4      5
5     10
Name: Exp, dtype: object

In [44]:
clean_data

     Name          Domain    Age   Location   Salary  Exp
0    Mike   Datascience#$     34     Mumbai   5^00#0    2
1  Teddy^         Testing     45  Bangalore  10%%000    3
2   Uma#r  Dataanalyst^^#  50.25        NaN  1$5%000    4
3    Jane     Ana^^lytics  50.25   Hyderbad   2000^0  4.8
4  Uttam*      Statistics     67        NaN   30000-    5
5     Kim             NLP     55      Delhi  6000^$0   10

In [45]:
clean_data['Location'].isnull().sum()

2

In [46]:
clean_data['Location']

0       Mumbai
1    Bangalore
2          NaN
3     Hyderbad
4          NaN
5        Delhi
Name: Location, dtype: object

In [78]:
emp['Salary']=emp['Salary'].str.replace(r'\W','',regex=True)

In [70]:
clean_data['Location'] = clean_data['Location'].fillna(clean_data['Location'].mode()[0])

In [71]:
clean_data['Location']

0       Mumbai
1    Bangalore
2    Bangalore
3     Hyderbad
4    Bangalore
5        Delhi
Name: Location, dtype: object

In [80]:
clean_data = emp.copy()

In [81]:
clean_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      6 non-null      object
 1   Domain    6 non-null      object
 2   Age       4 non-null      object
 3   Location  4 non-null      object
 4   Salary    6 non-null      object
 5   Exp       5 non-null      object
dtypes: object(6)
memory usage: 420.0+ bytes

In [82]:
clean_data

     Name          Domain  Age   Location Salary  Exp
0    Mike   Datascience#$   34     Mumbai   5000    2
1  Teddy^         Testing   45  Bangalore  10000    3
2   Uma#r  Dataanalyst^^#  NaN        NaN  15000    4
3    Jane     Ana^^lytics  NaN   Hyderbad  20000  NaN
4  Uttam*      Statistics   67        NaN  30000    5
5     Kim             NLP   55      Delhi  60000   10

In [52]:
clean_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      6 non-null      object
 1   Domain    6 non-null      object
 2   Age       6 non-null      int32
 3   Location  6 non-null      object
 4   Salary    6 non-null      object
 5   Exp       6 non-null      object
dtypes: int32(1), object(5)
memory usage: 396.0+ bytes

In [90]:
clean_data['Salary'] = clean_data['Salary'].astype(int)

In [92]:
clean_data['Exp'] = clean_data['Salary'].astype(int)

In [93]:
clean_data

     Name          Domain  Age   Location  Salary    Exp
0    Mike   Datascience#$   34     Mumbai    5000   5000
1  Teddy^         Testing   45  Bangalore   10000  10000
2   Uma#r  Dataanalyst^^#  NaN        NaN   15000  15000
3    Jane     Ana^^lytics  NaN   Hyderbad   20000  20000
4  Uttam*      Statistics   67        NaN   30000  30000
5     Kim             NLP   55      Delhi   60000  60000

In [95]:
emp['Name'] = emp['Name'].str.replace(r'\W','',regex=True)

In [96]:
emp['Domain']=emp['Domain'].str.replace(r'\W','',regex=True)

In [98]:
clean_data = emp.copy()

In [99]:
clean_data

    Name       Domain  Age   Location Salary  Exp
0   Mike  Datascience   34     Mumbai   5000    2
1  Teddy      Testing   45  Bangalore  10000    3
2   Umar  Dataanalyst  NaN        NaN  15000    4
3   Jane    Analytics  NaN   Hyderbad  20000  NaN
4  Uttam   Statistics   67        NaN  30000    5
5    Kim          NLP   55      Delhi  60000   10

In [100]:
clean_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      6 non-null      object
 1   Domain    6 non-null      object
 2   Age       4 non-null      object
 3   Location  4 non-null      object
 4   Salary    6 non-null      object
 5   Exp       5 non-null      object
dtypes: object(6)
memory usage: 420.0+ bytes

In [101]:
clean_data['Name'] = clean_data['Name'].astype('category')
clean_data['Domain'] = clean_data['Domain'].astype('category')
clean_data['Location'] = clean_data['Location'].astype('category')

In [ ]:
clean_data =

In [102]:
clean_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      6 non-null      category
 1   Domain    6 non-null      category
 2   Age       4 non-null      object
 3   Location  4 non-null      category
 4   Salary    6 non-null      object
 5   Exp       5 non-null      object
dtypes: category(3), object(3)
memory usage: 938.0+ bytes

In [108]:
clean_data

    Name       Domain  Age   Location  Salary  Exp
0   Mike  Datascience   34     Mumbai    5000    2
1  Teddy      Testing   45  Bangalore   10000    3
2   Umar  Dataanalyst  NaN        NaN   15000    4
3   Jane    Analytics  NaN   Hyderbad   20000  NaN
4  Uttam   Statistics   67        NaN   30000    5
5    Kim          NLP   55      Delhi   60000   10

In [116]:
clean_data['Location'] = clean_data['Location'].fillna(clean_data['Location'].mode()[0])

In [117]:
clean_data['Location']

0       Mumbai
1    Bangalore
2    Bangalore
3     Hyderbad
4    Bangalore
5        Delhi
Name: Location, dtype: category
Categories (4, object): ['Bangalore', 'Delhi', 'Hyderbad', 'Mumbai']

In [119]:
clean_data['Age'] = clean_data['Age'].fillna(clean_data['Age'].mode()[0])

In [120]:
clean_data['Age']

0    34
1    45
2    34
3    34
4    67
5    55
Name: Age, dtype: object

In [124]:
clean_data['Exp'] = clean_data['Exp'].fillna(clean_data['Exp'].mode()[0])

In [125]:
clean_data

    Name       Domain Age   Location  Salary Exp
0   Mike  Datascience  34     Mumbai    5000   2
1  Teddy      Testing  45  Bangalore   10000   3
2   Umar  Dataanalyst  34  Bangalore   15000   4
3   Jane    Analytics  34   Hyderbad   20000  10
4  Uttam   Statistics  67  Bangalore   30000   5
5    Kim          NLP  55      Delhi   60000  10

In [126]:
clean_data['Age'] = clean_data['Age'].astype(int)

In [128]:
clean_data['Salary']= clean_data['Salary'].astype(int)

In [130]:
clean_data['Exp'] = clean_data['Exp'].astype(int)

In [131]:
clean_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      6 non-null      category
 1   Domain    6 non-null      category
 2   Age       6 non-null      int32
 3   Location  6 non-null      category
 4   Salary    6 non-null      int32
 5   Exp       6 non-null      int32
dtypes: category(3), int32(3)
memory usage: 866.0 bytes

In [132]:
clean_data['Name'] = clean_data['Name'].astype('category')
clean_data['Domain'] = clean_data['Domain'].astype('category')
clean_data['Location'] = clean_data['Location'].astype('category')

In [133]:
clean_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      6 non-null      category
 1   Domain    6 non-null      category
 2   Age       6 non-null      int32
 3   Location  6 non-null      category
 4   Salary    6 non-null      int32
 5   Exp       6 non-null      int32
dtypes: category(3), int32(3)
memory usage: 866.0 bytes

In [135]:
clean_data.to_csv('clean_data.csv')

In [136]:
import os
os.getcwd()

'C:\\Users\\marot\\Naresh IT\\Practice Folder'

In [111]:
clean_data

    Name       Domain  Age   Location  Salary  Exp
0   Mike  Datascience   34     Mumbai    5000    2
1  Teddy      Testing   45  Bangalore   10000    3
2   Umar  Dataanalyst  NaN        NaN   15000    4
3   Jane    Analytics  NaN   Hyderbad   20000  NaN
4  Uttam   Statistics   67        NaN   30000    5
5    Kim          NLP   55      Delhi   60000   10

# EDA TECHNIQUE LETS APPLY

In [ ]:
import matplotlib.pyplot as plt # visualization
import seaborn as sns

In [ ]:
import warnings
warnings.filterwarnings('ignore')

In [ ]:
clean_data['Salary']

In [ ]:
vis1 = sns.distplot(clean_data['Salary'])

In [ ]:
vis2 = plt.hist(clean_data['Salary'])

In [ ]:
vis4 = sns.lmplot(data=clean_data,x = 'Exp', y='Salary')

In [ ]:
vis5 = sns.lmplot(data=clean_data,x = 'Exp', y='Salary', fit_reg = False)

In [ ]:
clean_data[:]

In [ ]:
clean_data[0:6:2]

In [ ]:
clean_data[::-1]

In [ ]:
clean_data.columns

In [ ]:
X_iv = clean_data[['Name', 'Domain', 'Age', 'Location', 'Exp']]

In [ ]:
X_iv

In [ ]:
y_dv = clean_data[['Salary']]

In [ ]:
y_dv

In [ ]:
emp

In [ ]:
clean_data

In [ ]:
X_iv

In [ ]:
y_dv

In [ ]:
clean_data

In [ ]:
imputation = pd.get_dummies(clean_data)

In [ ]:
imputation

In [ ]:
clean_data

In [ ]:
imputation

### raw data with lot of regex, missing, uncleandata
### regex, clean 
## fill missing numerical & cateigroica
## clean_dataset ( data cleaning) 3 month - 5mont
## outlier treatement, univati, bivariate, corelation 
## split the data into x_i.v & y_dv
## impute cateogrica data to numerical 
## eda part complete

# Next step 
- we splitn x_iv -- x_train, x_test
- we split y_dv -- y_train, y_test
- build the ml model with x_train & y_train